$(function(){
	var Province_City =  new Array();
	Province_City=['北京市','上海市','天津市','重庆市','河北省','山西省','内蒙古省','辽宁省','吉林省','黑龙江省','江苏省','浙江省','安徽省','福建省','江西省'
	               ,'山东省','河南省','湖北省','湖南省','广东省','广西省','海南省','四川省','贵州省','云南省','西藏省','陕西省','甘肃省','宁夏省','青海省'
	               ,'新疆省','香港','澳门','台湾省'];
//	Province_City["北京市"] = '东城|西城|崇文|宣武|朝阳|丰台|石景山|海淀|门头沟|房山|通州|顺义|昌平|大兴|平谷|怀柔|密云|延庆';  //欢迎来到站长特效网，我们的网址是www.zzjs.net，很好记，zz站长，js就是js特效，本站收集大量高质量js代码，还有许多广告代码下载。
	Province_City["北京市"] = '北京市';  //欢迎来到站长特效网，我们的网址是www.zzjs.net，很好记，zz站长，js就是js特效，本站收集大量高质量js代码，还有许多广告代码下载。
//	Province_City["上海市"] = '黄浦|卢湾|徐汇|长宁|静安|普陀|闸北|虹口|杨浦|闵行|宝山|嘉定|浦东|金山|松江|青浦|南汇|奉贤|崇明';//欢迎来到站长特效网，我们的网址是www.zzjs.net，很好记，zz站长，js就是js特效，本站收集大量高质量js代码，还有许多广告代码下载。
	Province_City["上海市"] = '上海市';//欢迎来到站长特效网，我们的网址是www.zzjs.net，很好记，zz站长，js就是js特效，本站收集大量高质量js代码，还有许多广告代码下载。
//	Province_City["天津市"] = '和平|东丽|河东|西青|河西|津南|南开|北辰|河北|武清|红挢|塘沽|汉沽|大港|宁河|静海|宝坻|蓟县';
	Province_City["天津市"] = '天津市';
//	Province_City["重庆市"] = '万州|涪陵|渝中|大渡口|江北|沙坪坝|九龙坡|南岸|北碚|万盛|双挢|渝北|巴南|黔江|长寿|綦江|潼南|铜梁|大足|荣昌|壁山|梁平|城口|丰都|垫江|武隆|忠县|开县|云阳|奉节|巫山|巫溪|石柱|秀山|酉阳|彭水|江津|合川|永川|南川';
	Province_City["重庆市"] = '重庆市';
	Province_City["河北省"] = '石家庄市|邯郸市|邢台市|保定市|张家口市|承德市|廊坊市|唐山市|秦皇岛市|沧州市|衡水市';
	Province_City["山西省"] = '太原市|大同市|阳泉市|长治市|晋城市|朔州市|吕梁市|忻州市|晋中市|临汾市|运城市';
	Province_City["内蒙古省"] = '呼和浩特市|包头市|乌海市|赤峰市|呼伦贝尔盟市|阿拉善盟市|哲里木盟市|兴安盟市|乌兰察布盟市|锡林郭勒盟市|巴彦淖尔盟市|伊克昭盟市';
	Province_City["辽宁省"] = '沈阳市|大连市|鞍山市|抚顺市|本溪市|丹东市|锦州市|营口市|阜新市|辽阳市|盘锦市|铁岭市|朝阳市|葫芦岛市';
	Province_City["吉林省"] = '长春市|吉林市|四平市|辽源市|通化市|白山市|松原市|白城市|延边市';
	Province_City["黑龙江省"] = '哈尔滨市|齐齐哈尔市|牡丹江市|佳木斯市|大庆市|绥化市|鹤岗市|鸡西市|黑河市|双鸭山市|伊春市|七台河市|大兴安岭市';
	Province_City["江苏省"] = '南京市|镇江市|苏州市|南通市|扬州市|盐城市|徐州市|连云港市|常州市|无锡市|宿迁市|泰州市|淮安市';
	Province_City["浙江省"] = '杭州市|宁波市|温州市|嘉兴市|湖州市|绍兴市|金华市|衢州市|舟山市|台州市|丽水市';
	Province_City["安徽省"] = '合肥市|芜湖市|蚌埠市|马鞍山市|淮北市|铜陵市|安庆市|黄山市|滁州市|宿州市|池州市|淮南市|巢湖市|阜阳市|六安市|宣城市|亳州市';
	Province_City["福建省"] = '福州市|厦门市|莆田市|三明市|泉州市|漳州市|南平市|龙岩市|宁德市';
	Province_City["江西省"] = '南昌市市|景德镇市|九江市|鹰潭市|萍乡市|新馀市|赣州市|吉安市|宜春市|抚州市|上饶市';
	Province_City["山东省"] = '济南市|青岛市|淄博市|枣庄市|东营市|烟台市|潍坊市|济宁市|泰安市|威海市|日照市|莱芜市|临沂市|德州市|聊城市|滨州市|菏泽市';
	Province_City["河南省"] = '郑州市|开封市|洛阳市|平顶山市|安阳市|鹤壁市|新乡市|焦作市|濮阳市|许昌市|漯河市|三门峡市|南阳市|商丘市|信阳市|周口市|驻马店市|济源市';
	Province_City["湖北省"] = '武汉市|宜昌市|荆州市|襄樊市|黄石市|荆门市|黄冈市|十堰市|恩施市|潜江市|天门市|仙桃市|随州市|咸宁市|孝感市|鄂州市';
	Province_City["湖南省"] = '长沙市|常德市|株洲市|湘潭市|衡阳市|岳阳市|邵阳市|益阳市|娄底市|怀化市|郴州市|永州市|湘西市|张家界市';
	Province_City["广东省"] = '广州市|深圳市|珠海市|汕头市|东莞市|中山市|佛山市|韶关市|江门市|湛江市|茂名市|肇庆市|惠州市|梅州市|汕尾市|河源市|阳江市|清远市|潮州市|揭阳市|云浮市';
	Province_City["广西省"] = '南宁市|柳州市|桂林市|梧州市|北海市|防城港市|钦州市|贵港市|玉林市|南宁地区市|柳州地区市|贺州市|百色市|河池市';
	Province_City["海南省"] = '海口市|三亚市';
	Province_City["四川省"] = '成都市|绵阳市|德阳市|自贡市|攀枝花市|广元市|内江市|乐山市|南充市|宜宾市|广安市|达川市|雅安市|眉山市|甘孜市|凉山市|泸州市';
	Province_City["贵州省"] = '贵阳市|六盘水市|遵义市|安顺市|铜仁市|黔西南市|毕节市|黔东南市|黔南市';
	Province_City["云南省"] = '昆明市|大理市|曲靖市|玉溪市|昭通市|楚雄市|红河市|文山市|思茅市|西双版纳市|保山市|德宏市|丽江市|怒江市|迪庆市|临沧市';
	Province_City["西藏省"] = '拉萨市|日喀则市|山南市|林芝市|昌都市|阿里市|那曲市';
	Province_City["陕西省"] = '西安市|宝鸡市|咸阳市|铜川市|渭南市|延安市|榆林市|汉中市|安康市|商洛市';
	Province_City["甘肃省"] = '兰州市|嘉峪关市|金昌市|白银市|天水市|酒泉市|张掖市|武威市|定西市|陇南市|平凉市|庆阳市|临夏市|甘南市';
	Province_City["宁夏省"] = '银川市|石嘴山市|吴忠市|固原市';
	Province_City["青海省"] = '西宁市|海东市|海南市|海北市|黄南市|玉树市|果洛市|海西市';
	Province_City["新疆省"] = '乌鲁木齐市|石河子市|克拉玛依市|伊犁市|巴音郭勒市|昌吉市|克孜勒苏柯尔克孜市|博尔塔拉市|吐鲁番市|哈密市|喀什市|和田市|阿克苏市';
	Province_City["香港"] = '香港';
	Province_City["澳门"] = '澳门';
	Province_City["台湾省"] = '台北市|高雄市|台中市|台南市|屏东市|南投市|云林市|新竹市|彰化市|苗栗市|嘉义市|花莲市|桃园市|宜兰市|基隆市|台东市|金门市|马祖市|澎湖市';

	if( $('.province').length !=  0 ) {
		$('.province').append('<option value=""  >--请选择省--</option>');
		var province_val = $('.province').val();
		var city_val =  $('.city').val();
		$.each( Province_City , function( k,v ){	//初始化省
//			var checked = v == province_val ? 'selected ' :'';
			$('.province').append( '<option value="' + v + '"  >' + v + '</option>' );
			});
		if( province_val != ''   ){
			$.each(  Province_City[province_val].split( '|' ) ,function( kk , vv ){	//初始化市
//				var checked = vv == city_val ? 'selected ' :'';
				$('.city').append( '<option value="' + vv + '"   >' + vv + '</option>' );
				});
			}
		$('.province').change( function(){	//联动效果
				var p_val = $(this).val();
		
				if( p_val == '' || $('.city').length== 0) {	//如果省的值为空，或者没有市级需求，将不会执行市级循环
					return false;
				}
				
				var province_ = Province_City[ p_val ];
				$('.city').empty();
				$('.city').append('<option value="" selected>--请选择市--</option>');
				
				$.each(  province_.split('|') ,function(kk,vv){
					$('.city').append( '<option value="' + vv + '" >' + vv + '</option>' );
					});
		});
	}
});
